In [3]:
import pandas as pd

## Series

In [4]:
data = [1, 2, 3, 4, 5]

In [5]:
s = pd.Series(data)

In [6]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [18]:
# Series dentro de uma lista
index = ['Linha' + str(i) for i in range(5)]

In [9]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [13]:
s = pd.Series(data = data, index = index)

In [14]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [17]:
# Series dentro de um dicion√°rio
data = {'linha' + str(i): i + 1 for i in range(5)}
data

{'linha0': 1, 'linha1': 2, 'linha2': 3, 'linha3': 4, 'linha4': 5}

In [19]:
s = pd.Series(data)

In [20]:
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [21]:
s1 = s + 2

In [22]:
s1

linha0    3
linha1    4
linha2    5
linha3    6
linha4    7
dtype: int64

## DataFrame

In [23]:
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

In [24]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [26]:
df1 = pd.DataFrame(data = data)

In [27]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [28]:
index = ['Linha' + str(i) for i in range(3)]
index

['Linha0', 'Linha1', 'Linha2']

In [29]:
df1 = pd.DataFrame(data = data, index = index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [30]:
columns = ['Coluna' + str(i) for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [31]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [49]:
data = {'Coluna0' : {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 4},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [50]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 4},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [51]:
df2 = pd.DataFrame(data)

In [52]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        4        9

In [55]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [57]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        4        9

In [58]:
df1[df1 > 0] = 'A'

In [59]:
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [62]:
df2[df2 > 0] = 'B'

In [63]:
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [64]:
df3[df3 > 0] = 'C'

In [65]:
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [66]:
df4 = pd.concat([df1, df2, df3])

In [67]:
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [68]:
# Transforma as linhas em colunas
df4 = pd.concat([df1, df2, df3], axis = 1)

In [69]:
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C